Backend/app/controllers/answers_controller.rb

INSERT INTO `answers` (`content`, `upvotes`, `downvotes`, `user_id`, `question_id`, `created_at`, `updated_at`) VALUES ('yeah it did change', 0, 0, 1, 8, '2015-05-29 19:34:01', '2015-05-29 19:34:01')
---
  def create
    answer = Answer.new(content: params[:content], upvotes: 0, downvotes:0, user_id: params[:user_id], question_id: params[:question_id])

    if answer.save