Backend/app/controllers/comments_controller.rb

  def create
    comment = Comment.new(content: params[:content], user_id: params[:user_id], question_id: params[:question_id], answer_id: params[:answer_id])

    if comment.save
---
INSERT INTO `comments` (`content`, `user_id`, `question_id`, `created_at`, `updated_at`) VALUES ('test comment', 1, 8, '2015-05-29 19:32:42', '2015-05-29 19:32:42')

  def update
    comment = Comment.find(params[:comment_id])

    if comment.update(content: params[:content])
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 2 LIMIT 1
UPDATE `comments` SET `content` = 'modified answer comment', `updated_at` = '2015-05-29 19:37:02' WHERE `comments`.`id` = 2

  def destroy
    comment = Comment.find(params[:comment_id])
    comment.destroy
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 2 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 2