Backend/app/controllers/questions_controller.rb

  def index
    # TODO :- URL's parent's questions

    questions = Question.where("url=?",params[:url]).paginate(:page => params[:page_num], :per_page => 10).order('difference DESC').select(:title,:id,:upvotes,:downvotes,:created_at)
---
SELECT  `questions`.`title`, `questions`.`id`, `questions`.`upvotes`, `questions`.`downvotes`, `questions`.`created_at` FROM `questions` WHERE (url='www.google.com')  ORDER BY difference DESC LIMIT 10 OFFSET 0

  def show
    question_id = params[:question_id]

    question = Question.find(question_id)
    answers = question.answers
    comments = question.comments
    all_comments = Array.new
    answer_list = Array.new
    answers.each do |answer|
      answer_map = Hash.new
      answer_map["answer"] = answer
      answer_map["comments"] = answer.comments
      answer_list << answer_map
    end

    tags = question.tags

    actual_tags = Array.new

    tags.each do |tag|
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 3 LIMIT 1
SELECT `answers`.* FROM `answers` WHERE `answers`.`question_id` = 3
SELECT `tags`.* FROM `tags` INNER JOIN `questions_tags` ON `tags`.`id` = `questions_tags`.`tag_id` WHERE `questions_tags`.`question_id` = 3

  def create
    question = Question.new(content: params[:content], title: params[:title], url: params[:url], upvotes: 0, downvotes: 0, difference: 0, user_id: params[:user_id])

    if question.save
       render json: {success: true, question: question, create_time: (question.created_at.to_f * 1000).to_i}
    else
       render json: {success: false}
    end

    tag_list = Array.new

    tag_list << params[:tag1]
    tag_list << params[:tag2]
    tag_list << params[:tag3]
    tag_list << params[:tag4]
    tag_list << params[:tag5]

    actual_tag_list = Array.new

    tag_list.each do |tag|
      t = Tag.find_by_name(tag)
---
INSERT INTO `questions` (`content`, `title`, `url`, `upvotes`, `downvotes`, `difference`, `user_id`, `created_at`, `updated_at`) VALUES ('is this working?', 'test question', 'www.google.com', 0, 0, 0, 1, '2015-05-29 19:05:08', '2015-05-29 19:05:08')
INSERT INTO `tags` (`name`, `created_at`, `updated_at`) VALUES ('hello', '2015-05-29 19:22:33', '2015-05-29 19:22:33')
SELECT  `tags`.* FROM `tags` WHERE `tags`.`name` = 'hello' LIMIT 1

  def update
    question = Question.find(params[:question_id])
    if question.update(content: params[:content], title: params[:title])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 8 LIMIT 1
UPDATE `questions` SET `content` = 'woah.. did it change?', `title` = 'yeah bitch', `updated_at` = '2015-05-29 19:25:48' WHERE `questions`.`id` = 8

  def destroy
    question = Question.find(params[:question_id])
    question.destroy
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = NULL LIMIT 1
DELETE FROM `questions` WHERE `questions`.`id` = 5