Backend/app/controllers/up_down_controller.rb

	def ques_upvote
    success = false

    updown_query = UpDown.where(:user_id => params[:user_id], :question_id => params[:question_id]).first
    if (updown_query)
      if(updown_query.down)
        updown_query.down = false
        updown_query.up = true
        updown_query.save
        success = true
        q = Question.find(params[:question_id])
        q.downvotes = q.downvotes-1
        q.upvotes = q.upvotes+1
        q.save
      else
        success = false
      end

    else
      UpDown.create(user_id:params[:user_id], question_id:params[:question_id], up:true, down:false)
---
SELECT  `up_downs`.* FROM `up_downs` WHERE `up_downs`.`user_id` = 1 AND `up_downs`.`question_id` = 8  ORDER BY `up_downs`.`id` ASC LIMIT 1
UPDATE `questions` SET `downvotes` = -2, `upvotes` = 1, `updated_at` = '2015-05-29 19:57:37' WHERE `questions`.`id` = 8
UPDATE `up_downs` SET `down` = 0, `up` = 1, `updated_at` = '2015-05-29 19:55:53' WHERE `up_downs`.`id` = 1
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 8 LIMIT 1
INSERT INTO `up_downs` (`user_id`, `question_id`, `up`, `down`, `created_at`, `updated_at`) VALUES (1, 8, 1, 0, '2015-05-29 19:49:10', '2015-05-29 19:49:10')

  def ques_downvote
    success = false
    updown_query = UpDown.where(:user_id => params[:user_id], :question_id => params[:question_id]).first
    if (updown_query)
      if(updown_query.up)
        updown_query.up = false
        updown_query.down = true
        updown_query.save
        success = true
        q = Question.find(params[:question_id])
        q.upvotes = q.upvotes-1
        q.downvotes = q.downvotes+1
        q.save
      else
        success = false
      end

    else
      UpDown.create(user_id:params[:user_id], question_id:params[:question_id], up:false, down:true)
---
SELECT  `up_downs`.* FROM `up_downs` WHERE `up_downs`.`user_id` = 1 AND `up_downs`.`question_id` = 8  ORDER BY `up_downs`.`id` ASC LIMIT 1
UPDATE `questions` SET `upvotes` = -1, `downvotes` = 1, `updated_at` = '2015-05-29 19:59:08' WHERE `questions`.`id` = 8
UPDATE `up_downs` SET `up` = 0, `down` = 1, `updated_at` = '2015-05-29 19:54:15' WHERE `up_downs`.`id` = 1
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 8 LIMIT 1
INSERT INTO `up_downs` (`user_id`, `question_id`, `up`, `down`, `created_at`, `updated_at`) VALUES (1, 8, 0, 1, '2015-05-29 20:04:45', '2015-05-29 20:04:45')