Backend/app/controllers/up_down_answer_controller.rb

SELECT  `up_down_answers`.* FROM `up_down_answers` WHERE `up_down_answers`.`answer_id` = 1 AND `up_down_answers`.`user_id` IS NULL  ORDER BY `up_down_answers`.`id` ASC LIMIT 1
UPDATE `answers` SET `downvotes` = 0, `upvotes` = 1, `updated_at` = '2015-05-29 20:07:20' WHERE `answers`.`id` = 1
UPDATE `up_down_answers` SET `down` = 0, `up` = 1, `updated_at` = '2015-05-29 20:07:20' WHERE `up_down_answers`.`id` = 1
SELECT  `answers`.* FROM `answers` WHERE `answers`.`id` = 1 LIMIT 1
INSERT INTO `up_down_answers` (`answer_id`, `up`, `down`, `created_at`, `updated_at`) VALUES (1, 1, 0, '2015-05-29 20:06:42', '2015-05-29 20:06:42')
---
  def ans_upvote
    success = false
    updown_query = UpDownAnswer.where(:user_id => params[:user_id], :answer_id => params[:answer_id]).first
    if (updown_query)
      if(updown_query.down)
        updown_query.down = false
        updown_query.up = true
        updown_query.save
        success = true
        q = Answer.find(params[:answer_id])
        q.downvotes = q.downvotes-1
        q.upvotes = q.upvotes+1
        q.save
      else
        success = false
      end

    else
      UpDownAnswer.create(user_id:params[:user_id], answer_id:params[:answer_id], up:true, down:false)

SELECT  `up_down_answers`.* FROM `up_down_answers` WHERE `up_down_answers`.`answer_id` = 1 AND `up_down_answers`.`user_id` IS NULL  ORDER BY `up_down_answers`.`id` ASC LIMIT 1
UPDATE `answers` SET `upvotes` = 0, `downvotes` = 1, `updated_at` = '2015-05-29 20:07:02' WHERE `answers`.`id` = 1
UPDATE `up_down_answers` SET `up` = 0, `down` = 1, `updated_at` = '2015-05-29 20:07:02' WHERE `up_down_answers`.`id` = 1
SELECT  `answers`.* FROM `answers` WHERE `answers`.`id` = 1 LIMIT 1
---
  def ans_downvote
    success = false
    updown_query = UpDownAnswer.where(:user_id => params[:user_id], :answer_id => params[:answer_id]).first
    if (updown_query)
      if(updown_query.up)
        updown_query.up = false
        updown_query.down = true
        updown_query.save
        success = true
        q = Answer.find(params[:answer_id])