Backend/app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'jeff'  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `auth_token` = '2e0b8d61fa2a6959d254b6ff5d0fb512249329097336a35568089933b49abdde', `updated_at` = '2015-05-29 20:41:13' WHERE `users`.`id` = 2
---
   def login
    user = User.where(:username => params[:username]).first
    user = user.authenticate(params[:password])
    success = true
    if user
      md5_hash = Digest::SHA2.hexdigest(params[:username])
      user.auth_token = md5_hash
      user.save

SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'jeff'  ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `users` (`username`, `email`, `auth_token`, `password_digest`, `created_at`, `updated_at`) VALUES ('jeff', 'jeff@gmail.com', 'abcd', '$2a$10$awpeILBI1JqJyUROcvcad.Z/JRVb1AJCf.uUqJ/U121/58qcudXa6', '2015-05-29 20:29:30', '2015-05-29 20:29:30')
---
  def create
    # require 'pry'
    # binding.pry
    user = User.where(:username => params[:username]).first
    success = true
    if user
      success = false
    else
      success = true
      md5_hash = Digest::SHA2.hexdigest(params[:username])
      user = User.create(username:params[:username], email:params[:email], auth_token:md5_hash, password:params[:password])

SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'jeff' AND `users`.`auth_token` = '2e0b8d61fa2a6959d254b6ff5d0fb512249329097336a35568089933b49abdde'  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `auth_token` = '', `updated_at` = '2015-05-29 20:46:27' WHERE `users`.`id` = 2
---
  def logout
    user = User.where(:username => params[:username], :auth_token => params[:auth_token]).first
    if(user)
      user.auth_token = ""
      user.save